In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('data/output1.csv')

In [3]:
df.head()

,CustomerID,Gender,Age,LastTransactionDate,CurrentBalance,TransactionCount,TotalTransactionAmount
0,C6624352,M,34,2016-09-27,152832.32,6,8375.74
1,C3226689,M,26,2016-09-30,96820.46,6,14758.39
2,C1026833,M,22,2016-08-31,118800.14,6,3336.00
3,C6222360,F,24,2016-12-09,5270.90,6,5825.00
4,C6735477,M,26,2016-12-09,12729.49,6,2504.00

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 7 columns):
 #   Column                  Non-Null Count   Dtype
---  ------                  --------------   -----
 0   CustomerID              100000 non-null  object
 1   Gender                  100000 non-null  object
 2   Age                     100000 non-null  int64
 3   LastTransactionDate     100000 non-null  object
 4   CurrentBalance          100000 non-null  float64
 5   TransactionCount        100000 non-null  int64
 6   TotalTransactionAmount  100000 non-null  float64
dtypes: float64(2), int64(2), object(3)
memory usage: 5.3+ MB

In [5]:
df['LastTransactionDate'].dtype

dtype('O')

In [6]:
def safe_to_datetime(col):
    """Attempt to convert a Series to datetime, using errors='coerce'. If conversion yields all NaT, return the original column."""
    try:
        converted = pd.to_datetime(col, errors='coerce')
        # If a significant number of values were converted, return the converted series
        if converted.notna().sum() > 0:
            print(f"DEBUG: Converted column to datetime with {converted.notna().sum()} non-NaT values.")
            return converted
        else:
            print("DEBUG: Conversion resulted in all NaT, returning original column.")
            return col
    except Exception as e:
        print(f"DEBUG: safe_to_datetime conversion error: {e}")
        return col

In [7]:
df['LastTransactionDate_changed'] = safe_to_datetime(df['LastTransactionDate'])

DEBUG: Converted column to datetime with 100000 non-NaT values.

In [8]:
df['LastTransactionDate_changed'].dtype

dtype('<M8[ns]')

In [9]:
rmf = pd.read_csv('rmf_results.csv')

In [10]:
rmf.shape

(100000, 17)

In [11]:
full = pd.read_csv('data/output.csv')

In [12]:
full.shape

(838456, 7)

In [13]:
rmf.columns

Index(['CustomerID', 'Gender', 'Age', 'LastTransactionDate', 'CurrentBalance',
       'TransactionCount', 'TotalTransactionAmount', 'LastTransactionDate.1',
       'TransactionCount.1', 'TotalTransactionAmount.1', 'recency_days',
       'R_Score', 'F_Score', 'M_Score', 'RMF_Score', 'RMF_Overall',
       'Segment_Description'],
      dtype='object')

In [14]:
full.columns

Index(['CustomerID', 'Gender', 'Age', 'LastTransactionDate', 'CurrentBalance',
       'TransactionCount', 'TotalTransactionAmount'],
      dtype='object')

In [15]:
import pandas as pd

# Assuming df_rmf contains the first dataset and df_full contains the second dataset
df_merged = pd.merge(full, rmf, on=['LastTransactionDate', 'TransactionCount', 'TotalTransactionAmount'], how='inner')

# If 'CustomerID' exists in both, use:
# df_merged = pd.merge(df_rmf, df_full, on='CustomerID', how='inner')

print(df_merged.head())

  CustomerID_x Gender_x  Age_x LastTransactionDate  CurrentBalance_x  \
0     C6624352        M     34          2016-09-27         152832.32
1     C3226689        M     26          2016-09-30          96820.46
2     C1026833        M     22          2016-08-31         118800.14
3     C6222360        F     24          2016-12-09           5270.90
4     C6735477        M     26          2016-12-09          12729.49

   TransactionCount  TotalTransactionAmount CustomerID_y Gender_y  Age_y  ...  \
0                 6                 8375.74     C6624352        M     34  ...
1                 6                14758.39     C3226689        M     26  ...
2                 6                 3336.00     C1026833        M     22  ...
3                 6                 5825.00     C6222360        F     24  ...
4                 6                 2504.00     C6735477        M     26  ...

   LastTransactionDate.1 TransactionCount.1  TotalTransactionAmount.1  \
0             2016-09-27                  6                   8375.74
1             2016-09-30                  6                  14758.39
2             2016-08-31                  6                   3336.00
3             2016-12-09                  6                   5825.00
4             2016-12-09                  6                   2504.00

   recency_days  R_Score  F_Score  M_Score  RMF_Score  RMF_Overall  \
0            73        4        5        5        455     4.666667
1            70        4        5        5        455     4.666667
2           100        3        5        4        354     4.000000
3             0        5        5        5        555     5.000000
4             0        5        5        4        554     4.666667

   Segment_Description
0            Champions
1            Champions
2            Champions
3            Champions
4            Champions

[5 rows x 21 columns]

In [16]:
df_merged.columns

Index(['CustomerID_x', 'Gender_x', 'Age_x', 'LastTransactionDate',
       'CurrentBalance_x', 'TransactionCount', 'TotalTransactionAmount',
       'CustomerID_y', 'Gender_y', 'Age_y', 'CurrentBalance_y',
       'LastTransactionDate.1', 'TransactionCount.1',
       'TotalTransactionAmount.1', 'recency_days', 'R_Score', 'F_Score',
       'M_Score', 'RMF_Score', 'RMF_Overall', 'Segment_Description'],
      dtype='object')

In [17]:
df_merged.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 173797 entries, 0 to 173796
Data columns (total 21 columns):
 #   Column                    Non-Null Count   Dtype
---  ------                    --------------   -----
 0   CustomerID_x              173797 non-null  object
 1   Gender_x                  173797 non-null  object
 2   Age_x                     173797 non-null  int64
 3   LastTransactionDate       173797 non-null  object
 4   CurrentBalance_x          173797 non-null  float64
 5   TransactionCount          173797 non-null  int64
 6   TotalTransactionAmount    173797 non-null  float64
 7   CustomerID_y              173797 non-null  object
 8   Gender_y                  173797 non-null  object
 9   Age_y                     173797 non-null  int64
 10  CurrentBalance_y          173797 non-null  float64
 11  LastTransactionDate.1     173797 non-null  object
 12  TransactionCount.1        173797 non-null  int64
 13  TotalTransactionAmount.1  173797 non-null  float64
 14  recency_days              173797 non-null  int64
 15  R_Score                   173797 non-null  int64
 16  F_Score                   173797 non-null  int64
 17  M_Score                   173797 non-null  int64
 18  RMF_Score                 173797 non-null  int64
 19  RMF_Overall               173797 non-null  float64
 20  Segment_Description       173797 non-null  object
dtypes: float64(5), int64(9), object(7)
memory usage: 27.8+ MB

In [18]:
df_merged.to_csv('data/output_merged.csv', index=False)

In [19]:
df_merged.shape

(173797, 21)

In [20]:
print(rmf.duplicated(subset=['LastTransactionDate', 'TransactionCount', 'TotalTransactionAmount']).sum())
print(full.duplicated(subset=['LastTransactionDate', 'TransactionCount', 'TotalTransactionAmount']).sum())

15931
527885

In [21]:
new = pd.read_csv('rmf_results.csv')

In [22]:
new.head()

,CustomerID,Gender,Age,LastTransactionDate,CurrentBalance,TransactionCount,TotalTransactionAmount,LastTransactionDate.1,TransactionCount.1,TotalTransactionAmount.1,recency_days,R_Score,F_Score,M_Score,RMF_Score,RMF_Overall,Segment_Description
0,C6624352,M,34,2016-09-27,152832.32,6,8375.74,2016-09-27,6,8375.74,73,4,5,5,455,4.666667,Champions
1,C3226689,M,26,2016-09-30,96820.46,6,14758.39,2016-09-30,6,14758.39,70,4,5,5,455,4.666667,Champions
2,C1026833,M,22,2016-08-31,118800.14,6,3336.00,2016-08-31,6,3336.00,100,3,5,4,354,4.000000,Champions
3,C6222360,F,24,2016-12-09,5270.90,6,5825.00,2016-12-09,6,5825.00,0,5,5,5,555,5.000000,Champions
4,C6735477,M,26,2016-12-09,12729.49,6,2504.00,2016-12-09,6,2504.00,0,5,5,4,554,4.666667,Champions

In [23]:
new_df = new[['CustomerID', 'Gender', 'Age','CurrentBalance', 'LastTransactionDate', 'TransactionCount', 'TotalTransactionAmount', 'R_Score', 'F_Score', 'M_Score','RMF_Score']]

In [24]:
new_df.head()

,CustomerID,Gender,Age,CurrentBalance,LastTransactionDate,TransactionCount,TotalTransactionAmount,R_Score,F_Score,M_Score,RMF_Score
0,C6624352,M,34,152832.32,2016-09-27,6,8375.74,4,5,5,455
1,C3226689,M,26,96820.46,2016-09-30,6,14758.39,4,5,5,455
2,C1026833,M,22,118800.14,2016-08-31,6,3336.00,3,5,4,354
3,C6222360,F,24,5270.90,2016-12-09,6,5825.00,5,5,5,555
4,C6735477,M,26,12729.49,2016-12-09,6,2504.00,5,5,4,554

In [25]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 11 columns):
 #   Column                  Non-Null Count   Dtype
---  ------                  --------------   -----
 0   CustomerID              100000 non-null  object
 1   Gender                  100000 non-null  object
 2   Age                     100000 non-null  int64
 3   CurrentBalance          100000 non-null  float64
 4   LastTransactionDate     100000 non-null  object
 5   TransactionCount        100000 non-null  int64
 6   TotalTransactionAmount  100000 non-null  float64
 7   R_Score                 100000 non-null  int64
 8   F_Score                 100000 non-null  int64
 9   M_Score                 100000 non-null  int64
 10  RMF_Score               100000 non-null  int64
dtypes: float64(2), int64(6), object(3)
memory usage: 8.4+ MB

In [26]:
new_df.to_csv('data/rmf_results_100K.csv', index=False)

In [27]:
new_df.F_Score.value_counts()

F_Score
1    84284
4    14257
5     1459
Name: count, dtype: int64

In [28]:
new_df.R_Score.value_counts()

R_Score
5    21798
3    19991
1    19807
2    19224
4    19180
Name: count, dtype: int64

In [29]:
new_df.M_Score.value_counts()

M_Score
4    20013
2    20013
1    20000
5    19987
3    19987
Name: count, dtype: int64

In [30]:
new_df.TransactionCount.value_counts()

TransactionCount
2    84284
3    14257
4     1346
5      107
6        6
Name: count, dtype: int64

In [31]:
new_df.TransactionCount.value_counts()

TransactionCount
2    84284
3    14257
4     1346
5      107
6        6
Name: count, dtype: int64